## How to Handle Duplicate Data

In [1]:
import pandas as pd

In [2]:
data = {"Name" :["a","b","c","d","a","c"] ,"eng":[8,7,5,8,8,5],"Bangla":[2,3,4,5,2,4]}

In [3]:
df = pd.DataFrame(data)
df

  Name  eng  Bangla
0    a    8       2
1    b    7       3
2    c    5       4
3    d    8       5
4    a    8       2
5    c    5       4

In [4]:
df.drop_duplicates(inplace = True)  # Drop duplicate rows and keep the first occurrence
df

  Name  eng  Bangla
0    a    8       2
1    b    7       3
2    c    5       4
3    d    8       5

In [5]:
# Check for duplicate rows
df["Duplicated"]= df.duplicated()
df

  Name  eng  Bangla  Duplicated
0    a    8       2       False
1    b    7       3       False
2    c    5       4       False
3    d    8       5       False

In [6]:
df.drop_duplicates(keep = "first")

  Name  eng  Bangla  Duplicated
0    a    8       2       False
1    b    7       3       False
2    c    5       4       False
3    d    8       5       False

In [7]:
dataset = pd.read_csv("bank-loan.csv")
dataset.head()

   age  ed  employ  address  income  debtinc   creddebt   othdebt  default
0   41   3      17       12     176      9.3  11.359392  5.008608      1.0
1   27   1      10        6      31     17.3   1.362202  4.000798      0.0
2   40   1      15       14      55      5.5   0.856075  2.168925      0.0
3   41   1      15       14     120      2.9   2.658720  0.821280      0.0
4   24   2       2        0      28     17.3   1.787436  3.056564      1.0

In [8]:
dataset.shape

(850, 9)

In [9]:
dataset.drop_duplicates(inplace = True)

In [10]:
dataset.shape

(850, 9)